In [6]:
import pandas as pd
import numpy as np
def split(df, headSize) :
    hd = df.head(headSize)
    tl = df.tail(len(df)-headSize)
    return hd, tl

df = pd.DataFrame({    'A':[2,4,6,8,10,2,4,6,8,10],
                       'B':[10,-10,0,20,-10,10,-10,0,20,-10],
                       'C':[4,12,8,0,0,4,12,8,0,0],
                      'D':[9,10,0,1,3,np.nan,np.nan,np.nan,np.nan,np.nan]})

# Split dataframe into top 3 rows (first) and the rest (second)
first, second = split(df, 3)

In [7]:
df

    A   B   C     D
0   2  10   4   9.0
1   4 -10  12  10.0
2   6   0   8   0.0
3   8  20   0   1.0
4  10 -10   0   3.0
5   2  10   4   NaN
6   4 -10  12   NaN
7   6   0   8   NaN
8   8  20   0   NaN
9  10 -10   0   NaN

In [4]:
first

   A   B   C     D
0  2  10   4   9.0
1  4 -10  12  10.0
2  6   0   8   0.0

In [8]:
second

    A   B   C    D
3   8  20   0  1.0
4  10 -10   0  3.0
5   2  10   4  NaN
6   4 -10  12  NaN
7   6   0   8  NaN
8   8  20   0  NaN
9  10 -10   0  NaN

In [17]:
type(second)

pandas.core.frame.DataFrame

In [25]:
third=second.iloc[:,:-1]

In [26]:
third

    A   B   C
3   8  20   0
4  10 -10   0
5   2  10   4
6   4 -10  12
7   6   0   8
8   8  20   0
9  10 -10   0